/*
 Navicat Premium Data Transfer

 Source Server         : docker_local
 Source Server Type    : MySQL
 Source Server Version : 50635
 Source Host           : localhost
 Source Database       : wadt

 Target Server Type    : MySQL
 Target Server Version : 50635
 File Encoding         : utf-8

 Date: 12/28/2016 17:21:58 PM
*/

SET NAMES utf8;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
--  Table structure for `perfectpeople`
-- ----------------------------
DROP TABLE IF EXISTS `perfectpeople`;
CREATE TABLE `perfectpeople` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `answer` varchar(255) DEFAULT NULL,
  `guid` varchar(255) DEFAULT NULL,
  `createtime` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Records of `perfectpeople`
-- ----------------------------
BEGIN;
INSERT INTO `perfectpeople` VALUES ('1', '', '', '[{\"id\":8,\"answer\":2},{\"id\":14,\"answer\":2},{\"id\":20,\"answer\":1}]', '7DE1E770-4DBA-58E0-1F95-EF9883429BFC', '2016-12-28 09:10:15'), ('2', '', '', '[{\"id\":17,\"answer\":1},{\"id\":19,\"answer\":2},{\"id\":20,\"answer\":1}]', 'E5FC6DC6-06E0-EE50-1203-0F1E776F30E8', '2016-12-28 09:10:24'), ('3', '', '', '[{\"id\":15,\"answer\":1},{\"id\":18,\"answer\":2},{\"id\":20,\"answer\":1}]', 'B06B8853-A2A8-0AB0-CB9D-52BF195676EA', '2016-12-28 09:21:25');
COMMIT;

-- ----------------------------
--  Table structure for `questions`
-- ----------------------------
DROP TABLE IF EXISTS `questions`;
CREATE TABLE `questions` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `content` varchar(255) DEFAULT NULL,
  `answer1` varchar(255) DEFAULT NULL,
  `answer2` varchar(255) DEFAULT NULL,
  `answer3` varchar(255) DEFAULT NULL,
  `answer4` varchar(255) DEFAULT NULL,
  `answer5` varchar(255) DEFAULT NULL,
  `answer6` varchar(255) DEFAULT NULL,
  `answer7` varchar(255) DEFAULT NULL,
  `answer8` varchar(255) DEFAULT NULL,
  `rightAnswer` varchar(255) DEFAULT NULL,
  `isMult` int(11) DEFAULT NULL,
  `createtime` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updatetime` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=21 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Records of `questions`
-- ----------------------------
BEGIN;
INSERT INTO `questions` VALUES ('1', '个人电脑上网如何确保上网安全', '安装个人防火墙', '下载来历不明的软件并安装执行', '登录不明来历的网站', '从不运行杀毒程序', '', '', '', '', '1', '0', '2016-06-30 15:34:11', '2016-06-30 15:46:19'), ('2', '以下哪些上网方式容易造成电脑中毒', '不要打开来自陌生人的电子邮件附件', '不要打开QQ等即时通信软件传来的文件', '随意下载软件并安装执行', '定期进行电脑病毒查杀', '', '', '', '', '3', '0', '2016-06-30 15:34:12', '2016-06-30 15:46:21'), ('3', '浏览网页时时如何确保信息安全', '采用匿名方式浏览，在使用浏览器的时候在参数选项中选择关闭计算机接收cookie的选项', '随意点击弹出的广告弹窗', '随意点开别人发过来的不明网址链接', '网页提示输入账号密码时不考虑就随意输入', '', '', '', '', '1', '0', '2016-06-30 15:34:13', '2016-06-30 15:46:22'), ('4', '如果设置上网密码', '从来不更换上网密码', '网上所有的账号密码都是一样的', '涉及资金和普通账号的密码都用的同一个密码', '密码都很强的复杂度，不同用途的密码也不相同', '', '', '', '', '4', '0', '2016-06-30 15:34:14', '2016-06-30 15:46:39'), ('5', '中央网络安全和信息化领导小组组长是谁', '习近平', '李克强', '刘云山', '贺国强', '', '', '', '', '1', '0', '2016-06-30 15:34:21', '2016-06-30 15:46:41'), ('6', '中央网络安全和信息化领导小组下设的办事机构是什么', '中央网络安全和信息化领导小组组委会', '中央网络安全和信息化领导小组办公室', '中央网络安全和信息化领导小组网络与信息安全局', '中央网络安全和信息化领导小组安全中心', '', '', '', '', '2', '0', '2016-06-30 15:34:38', '2016-06-30 15:46:42'), ('7', '下列那句话不是习近平总书记在2016年网络安全和信息化工作座谈会上的讲话', '习近平指出，要建设网络良好生态，发挥网络引导舆论、反映民意的作用。', '网络空间是亿万民众共同的精神家园。网络空间天朗气清、生态良好，符合人民利益。网络空间乌烟瘴气、生态恶化，不符合人民利益', '网络安全和信息化是相辅相成的。安全是发展的前提，发展是安全的保障，安全和发展要同步推进', '现在，大家都在讨论中国梦，我以为，实现中华民族伟大复兴，就是中华民族近代以来最伟大的梦想。', '', '', '', '', '4', '0', '2016-06-30 15:34:42', '2016-06-30 15:46:43'), ('8', '浏览网页时，遇到的最常见的网络广告形式是', '飘移广告', '旗帜广告', '', '', '', '', '', '', '2', '0', '2016-06-30 15:35:24', '2016-06-30 15:46:46'), ('9', '下列选项中，不属于个人隐私信息的是', '感情经历', '工作单位', '日记', '身体健康情况', '', '', '', '', '2', '0', '2016-06-30 15:35:24', '2016-06-30 15:46:49'), ('10', '下列有关隐私权的表述，错误的是', '网络时代，隐私权的保护受到较大冲击', '可以借助法律来保护网络隐私权', '由于网络是虚拟世界，所以在网上不需要保护个人的隐私', '虽然网络世界不同于现实世界，但也需要保护个人隐私', '', '', '', '', '3', '0', '0000-00-00 00:00:00', '2016-08-31 09:11:58'), ('11', '电话黑卡是指', '未进行实名登记的手机电话卡', '未进行实名登记，且被不法分子利用实施违法犯罪活动的移动电话卡（含无线上网卡）', '', '', '', '', '', '', '2', '0', '2016-06-30 15:35:24', '2016-06-30 15:35:24'), ('12', '为了从源头上治理利用网络、电话和手机发送不良违法信息的行为，维护健康消费的网络环境，国家推动了以下哪项工作？', '电话用户实名制', '“手机黑卡”整治', '', '', '', '', '', '', '1', '0', '2016-06-30 15:35:24', '2016-06-30 15:35:24'), ('13', '小陈在一家网站上看到点击短信中的链接即可1折购买iPhone6S，正确的做法是', '按照要求安装APP，购买1折的iPhone6S', '不安装，并打开安全软件进行查杀', '', '', '', '', '', '', '2', '0', '2016-06-30 15:35:24', '2016-06-30 15:35:24'), ('14', '为什么要定期修改电脑、邮箱、网站的密码？', '降低电脑受损的几率', '降低密码被黑客破解的机会，确保数据和个人隐私安全', '', '', '', '', '', '', '2', '0', '2016-06-30 15:35:24', '2016-06-30 15:35:24'), ('15', '在微信、QQ等工具中接收到一条信息要求继续转发，否则会有不好的结果或影响。正确的的做法是', '此类信息一般没有积极意义，常常涉嫌人身攻击等，不应转发', '涉及个人和家人安危，宁信其有不信其无，不愿意也要转', '', '', '', '', '', '', '1', '0', '2016-06-30 15:35:24', '2016-06-30 15:35:24'), ('16', '李女士被告知：父母突然出车祸，需要住院，让她赶紧给汇款。对方自称是李女士的家乡人，知道李女士的姓名、家庭住址、父母名字等信息。遇到这种情况李女士的正确做法是', '电话核查了那么多信息都是正确的，应该果断快速汇款给对方', '联系父母验证事情真伪后，再决定是否汇款，如确认是电信诈骗应及时报警', '', '', '', '', '', '', '2', '0', '2016-06-30 15:35:23', '2016-06-30 15:35:23'), ('17', '微信收到“微信团队”的安全提示：“您的微信账号在16:46尝试在另一个设备登录。登录设备：XX品牌XX型号”。这时我们应该', '确认是否是自己的设备登录，如果不是，则尽快修改密码', '自己的密码足够复杂，不可能被破解，不用修改密码', '', '', '', '', '', '', '1', '0', '2016-06-30 15:35:23', '2016-06-30 15:35:23'), ('18', '你收到一条10001发来的短信，“尊敬的用户，您好。您的手机号码实名制认证不通过，请到XXXX网站进行实名制验证，否则您的手机号码将会在24小时之内被停机”，请问，这是遇到了什么情况？', '手机号码没有实名制认证', '伪基站诈骗', '', '', '', '', '', '', '2', '0', '2016-06-30 15:35:23', '2016-06-30 15:35:23'), ('19', '你在网站上看到一则促销消息，只需要填写个人信息就能免费获得小礼品。以下哪种行为是最安全的', '填写信息，免费得小礼品', '关闭网站，不填写自己的信息', '', '', '', '', '', '', '2', '0', '2016-06-30 15:35:23', '2016-06-30 15:35:23'), ('20', '路边举办活动，用手机扫描二维码下载软件就可以得到礼物。正确的做法是', '直接拒绝 ', '手机安装杀毒软件，然后扫描下载', '', '', '', '', '', '', '1', '0', '2016-06-30 15:35:23', '2016-06-30 15:35:23');
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
